import ServiceComponent from '../serviceComponent/Service-component';
import styles from './about.module.css';

export default function About() {

    const services: Record<string, string>[] = [
        { 
            name: 'УЗД серця дорослих та дітей', 
            description: 'Безболісне і безпечне дослідження серця для дорослих та дітей. Допомагає виявити структурні та функціональні зміни серця на ранніх стадіях.' 
        },
        { 
            name: 'УЗД судин шиї та голови', 
            description: 'Дослідження судин шиї та головного мозку для оцінки кровотоку та виявлення аномалій. Проводиться швидко та безболісно.' 
        },
        { 
            name: 'УЗД черевної порожнини', 
            description: 'Детальне обстеження внутрішніх органів черевної порожнини. Дозволяє виявити запальні процеси, пухлини та інші патології.' 
        },
        { 
            name: 'Холтерівське моніторування ЕКГ', 
            description: 'Цілодобове спостереження за роботою серця з фіксацією ритму та можливих порушень. Допомагає діагностувати аритмії, що не проявляються при звичайному обстеженні.' 
        },
        { 
            name: 'Холтерівське моніторування АТ (СМАД)', 
            description: '24-годинне вимірювання артеріального тиску для оцінки його коливань протягом дня та ночі. Допомагає точно підібрати лікування гіпертонії.' 
        },
        { 
            name: 'Електрокардіограма (ЕКГ)', 
            description: 'Швидке дослідження електричної активності серця. Допомагає виявити аритмії, ішемію та інші порушення серцевого ритму.' 
        },
        { 
            name: 'Консультації кардіолога', 
            description: 'Професійна оцінка стану серцево-судинної системи дорослих. Включає аналіз обстежень та рекомендації щодо лікування і профілактики.' 
        },
        { 
            name: 'Консультації дитячого кардіолога', 
            description: 'Огляд серця та судин дітей будь-якого віку. Дозволяє вчасно виявити вроджені та набуті порушення серцевої діяльності.' 
        },
        {
            name: 'Консультація кардіоревматолога',
            description: 'Консультація кардіолога при ревматологічних та аутоімунних захворюваннях із діагностикою та підбором лікування серцевих ускладнень.'
        }
    ];

    return (
        <section id = "services" className={styles.about}>
            <h2 className={styles.aboutTitle}>Професійні послуги</h2>
            <div className={styles.aboutContent}>
                {
                    services.map((service, index) => 
                        <ServiceComponent
                            key={index}
                            name={service.name}
                            description={service.description}
                        />
                    )
                }
            </div>
        </section>
    );
}